{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "b07e8471-e108-4bed-881a-7a72e911f506",
   "metadata": {},
   "source": [
    "# ImportToDesktop\n",
    "Imports data and metadata csv files into a Neo4j Desktop database.\n",
    "\n",
    "Before running this notebook, follow the [instructions](https://github.com/sbl-sdsc/kg-import/tree/main?tab=readme-ov-file#data-import-into-neo4j-knowledge-graph) and start  the Neo4j Graph DBMS."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "3d094c16-6187-478b-90e0-a563f6741b26",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Path to environment file\n",
    "ENV_PATH = \"../.env_desktop\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f717c7ed-419f-4223-a7b5-60b5735b0ca3",
   "metadata": {},
   "source": [
    "## Setup"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d4a4f63b-1fbe-4415-ac27-7bb29ad2cc75",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import time\n",
    "import pandas as pd\n",
    "from py2neo import Graph\n",
    "import shutil\n",
    "import requests\n",
    "\n",
    "from dotenv import load_dotenv\n",
    "load_dotenv(ENV_PATH, override=True)\n",
    "\n",
    "pd.set_option('display.max_colwidth', None)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "daa6b10c-a6ef-411a-a1e7-911c630c282e",
   "metadata": {},
   "outputs": [],
   "source": [
    "def download_http(url, filename):\n",
    "    if os.path.exists(filename):\n",
    "        os.remove(filename)\n",
    "    data = requests.get(url)\n",
    "    with open(filename, 'wb')as file:\n",
    "        file.write(data.content)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "fa8dd0f6-5875-467c-85ed-1d30209f3e39",
   "metadata": {},
   "outputs": [],
   "source": [
    "# copy required files (temporary solution)\n",
    "download_http(\"https://raw.githubusercontent.com/pwrose/neo4j-ipycytoscape/master/notebooks/neo4j_utils.py\", \"neo4j_utils.py\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "d31a6840-c805-4cac-9883-e9c20fcb7e9c",
   "metadata": {},
   "outputs": [],
   "source": [
    "import neo4j_utils\n",
    "import neo4j_bulk_importer"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "eda2db84-628b-4249-8bcb-1257c2a919ce",
   "metadata": {},
   "source": [
    "## Import the Knowledge Graph\n",
    "CSV data and metadata files are uploaded into the Neo4j Graph database from the kg directory using the kg-import bulk upload scripts. For a description of the data organization and the specification of metadata see."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "7c6393e5-a450-426e-ba42-67a933bb4956",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "drop_database: '/Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/bin/cypher-shell' -d system -u neo4j -p neo4jdemo 'DROP DATABASE `kg-import` IF EXISTS;'\n",
      "\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "24d37668a43a4ddc8401a60ef15c7a8b",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Executing:   0%|          | 0/85 [00:00<?, ?cell/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "run_bulk_import: cd '/Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import'; '/Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/bin/neo4j-admin' database import full kg-import --overwrite-destination --skip-bad-relationships --skip-duplicate-nodes --multiline-fields --array-delimiter='|' @args.txt\n",
      "Neo4j version: 5.12.0\n",
      "Importing the contents of these files into /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/data/databases/kg-import:\n",
      "Nodes:\n",
      "  [Disease]:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_Disease_n.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/Disease_n.csv\n",
      "\n",
      "  [State]:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_State_n.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/State_n.csv\n",
      "\n",
      "  [MetaNode]:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/MetaNode_n.csv\n",
      "\n",
      "  [Patient]:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_Patient_n.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/Patient_2020_n.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/Patient_2021_n.csv\n",
      "\n",
      "  [City]:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_City_n.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/City_n.csv\n",
      "\n",
      "  [Symptom]:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_Symptom_n.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/Symptom_n.csv\n",
      "\n",
      "Relationships:\n",
      "  LOCATED_IN:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_City-LOCATED_IN-State_r.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/City-LOCATED_IN-State_r.csv\n",
      "\n",
      "  PRESENTS:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_Disease-PRESENTS-Symptom_r.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/Disease-PRESENTS-Symptom_r.csv\n",
      "\n",
      "  SHOWS:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_Patient-SHOWS-Symptom_r.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/Patient-SHOWS-Symptom_r.csv\n",
      "\n",
      "  DIAGNOSED_WITH:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_Patient-DIAGNOSED_WITH-Disease_r.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/Patient-DIAGNOSED_WITH-Disease_2020_r.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/Patient-DIAGNOSED_WITH-Disease_2021_r.csv\n",
      "\n",
      "  MetaRelationship:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/MetaRelationship_r.csv\n",
      "\n",
      "  LIVES_IN:\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_Patient-LIVES_IN-City_r.csv\n",
      "  /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/Patient-LIVES_IN-City_r.csv\n",
      "\n",
      "\n",
      "Available resources:\n",
      "  Total machine memory: 16.00GiB\n",
      "  Free machine memory: 4.418GiB\n",
      "  Max heap memory : 910.5MiB\n",
      "  Max worker threads: 8\n",
      "  Configured max memory: 3.305GiB\n",
      "  High parallel IO: true\n",
      "\n",
      "Cypher type normalization is enabled (disable with --normalize-types=false):\n",
      "  Property type of 'population' normalized from 'int' --> 'long' in /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_State_n.csv\n",
      "  Property type of 'age' normalized from 'int' --> 'long' in /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_Patient_n.csv\n",
      "  Property type of 'population' normalized from 'int' --> 'long' in /Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/header_City_n.csv\n",
      "\n",
      "Import starting 2024-04-30 12:21:29.450-0700\n",
      "  Estimated number of nodes: 13.00 \n",
      "  Estimated number of node properties: 51.00 \n",
      "  Estimated number of relationships: 17.00 \n",
      "  Estimated number of relationship properties: 24.00 \n",
      "  Estimated disk space usage: 4.807KiB\n",
      "  Estimated required memory usage: 510.0MiB\n",
      "\n",
      "(1/4) Node import 2024-04-30 12:21:29.973-0700\n",
      "  Estimated number of nodes: 13.00 \n",
      "  Estimated disk space usage: 3.164KiB\n",
      "  Estimated required memory usage: 510.0MiB\n",
      "-......... .......... .......... .......... ..........   5% ∆38ms\n",
      ".......... .......... .......... .......... ..........  10% ∆2ms\n",
      ".......... .......... .......... .......... ..........  15% ∆1ms\n",
      ".......... .......... .......... .......... ..........  20% ∆1ms\n",
      ".......... .......... .......... .......... ..........  25% ∆0ms\n",
      ".......... .......... .......... .......... ..........  30% ∆1ms\n",
      ".......... .......... .......... .......... ..........  35% ∆1ms\n",
      ".......... .......... .......... .......... ..........  40% ∆0ms\n",
      ".......... .......... .......... .......... ..........  45% ∆1ms\n",
      ".......... .......... .......... .......... ..........  50% ∆0ms\n",
      ".......... .......... .......... .......... ..........  55% ∆0ms\n",
      ".......... .......... .......... .......... ..........  60% ∆1ms\n",
      ".......... .......... .......... .......... ..........  65% ∆0ms\n",
      ".......... .......... .......... .......... ..........  70% ∆1ms\n",
      ".......... .......... .......... .......... ..........  75% ∆0ms\n",
      ".......... .......... .......... .......... ..........  80% ∆0ms\n",
      ".......... .......... .......... .......... ..........  85% ∆1ms\n",
      ".......... .......... .......... .......... ..........  90% ∆0ms\n",
      ".......... .......... .......... .......... ..........  95% ∆1ms\n",
      ".......... .......... .......... .......... .......... 100% ∆0ms\n",
      "\n",
      "Node import COMPLETED in 791ms\n",
      "\n",
      "(2/4) Relationship import 2024-04-30 12:21:30.764-0700\n",
      "  Estimated number of relationships: 17.00 \n",
      "  Estimated disk space usage: 1.643KiB\n",
      "  Estimated required memory usage: 517.6MiB\n",
      ".......... .......... .......... .......... ..........   5% ∆1s 2ms\n",
      ".......... .......... .......... .......... ..........  10% ∆0ms\n",
      ".......... .......... .......... .......... ..........  15% ∆0ms\n",
      ".......... .......... .......... .......... ..........  20% ∆1ms\n",
      ".......... .......... .......... .......... ..........  25% ∆0ms\n",
      ".......... .......... .......... .......... ..........  30% ∆0ms\n",
      ".......... .......... .......... .......... ..........  35% ∆0ms\n",
      ".......... .......... .......... .......... ..........  40% ∆0ms\n",
      ".......... .......... .......... .......... ..........  45% ∆1ms\n",
      ".......... .......... .......... .......... ..........  50% ∆0ms\n",
      ".......... .......... .......... .......... ..........  55% ∆0ms\n",
      ".......... .......... .......... .......... ..........  60% ∆1ms\n",
      ".......... .......... .......... .......... ..........  65% ∆0ms\n",
      ".......... .......... .......... .......... ..........  70% ∆0ms\n",
      ".......... .......... .......... .......... ..........  75% ∆1ms\n",
      ".......... .......... .......... .......... ..........  80% ∆0ms\n",
      ".......... .......... .......... .......... ..........  85% ∆0ms\n",
      ".......... .......... .......... .......... ..........  90% ∆0ms\n",
      ".......... .......... .......... .......... ..........  95% ∆1ms\n",
      ".......... .......... .......... .......... .......... 100% ∆0ms\n",
      "\n",
      "Relationship import COMPLETED in 1s 7ms\n",
      "\n",
      "(3/4) Relationship linking 2024-04-30 12:21:31.772-0700\n",
      "  Estimated required memory usage: 510.0MiB\n",
      "-......... .......... .......... .......... ..........   5% ∆301ms\n",
      ".......... .......... .......... .......... ..........  10% ∆0ms\n",
      ".......... .......... .......... .......... ..........  15% ∆0ms\n",
      ".......... .......... .......... .......... ..........  20% ∆0ms\n",
      ".......... .......... .......... .......... ..........  25% ∆1ms\n",
      ".......... .......... .......... .......... ..........  30% ∆0ms\n",
      ".......... .......... .......... .......... ..........  35% ∆0ms\n",
      ".......... .......... .......... .......... ..........  40% ∆0ms\n",
      ".......... .......... .......... .......... ..........  45% ∆1ms\n",
      ".......... .......... .......... .......... ..........  50% ∆0ms\n",
      ".......... .......... .......... .......... ..........  55% ∆0ms\n",
      ".......... .......... .......... .......... ..........  60% ∆0ms\n",
      ".......... .......... .......... .......... ..........  65% ∆0ms\n",
      ".......... .......... .......... .......... ..........  70% ∆1ms\n",
      ".......... .......... .......... .......... ..........  75% ∆0ms\n",
      ".......... .......... .......... .......... ..........  80% ∆0ms\n",
      ".......... .......... .......... .......... ..........  85% ∆0ms\n",
      ".......... .......... .......... .......... ..........  90% ∆0ms\n",
      ".......... .......... .......... .......... ..........  95% ∆1ms\n",
      ".......... .......... .......... .......... .......... 100% ∆0ms\n",
      "\n",
      "Relationship linking COMPLETED in 431ms\n",
      "\n",
      "(4/4) Post processing 2024-04-30 12:21:32.204-0700\n",
      "  Estimated required memory usage: 510.0MiB\n",
      "-......... .......... .......... .......... ..........   5% ∆409ms\n",
      ".......... .......... .......... .......... ..........  10% ∆0ms\n",
      ".......... .......... .......... .......... ..........  15% ∆0ms\n",
      ".......... .......... .......... .......... ..........  20% ∆1ms\n",
      ".......... .......... .......... .......... ..........  25% ∆0ms\n",
      ".......... .......... .......... .......... ..........  30% ∆0ms\n",
      ".......... .......... .......... .......... ..........  35% ∆0ms\n",
      ".......... .......... .......... .......... ..........  40% ∆1ms\n",
      ".......... .......... .......... .......... ..........  45% ∆0ms\n",
      ".......... .......... .......... .......... ..........  50% ∆0ms\n",
      ".......... .......... .......... .......... ..........  55% ∆0ms\n",
      ".......... .......... .......... .......... ..........  60% ∆1ms\n",
      ".......... .......... .......... .......... ..........  65% ∆0ms\n",
      ".......... .......... .......... .......... ..........  70% ∆0ms\n",
      ".......... .......... .......... .......... ..........  75% ∆1ms\n",
      ".......... .......... .......... .......... ..........  80% ∆0ms\n",
      ".......... .......... .......... .......... ..........  85% ∆0ms\n",
      ".......... .......... .......... .......... ..........  90% ∆0ms\n",
      ".......... .......... .......... .......... ..........  95% ∆0ms\n",
      ".......... .......... .......... .......... .......... 100% ∆1ms\n",
      "\n",
      "Post processing COMPLETED in 1s 87ms\n",
      "\n",
      "\n",
      "IMPORT DONE in 5s 523ms. \n",
      "Imported:\n",
      "  19 nodes\n",
      "  22 relationships\n",
      "  101 properties\n",
      "Peak memory usage: 517.6MiB\n",
      "\n",
      "create_database: '/Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/bin/cypher-shell' -d system -u neo4j -p neo4jdemo 'CREATE OR REPLACE DATABASE `kg-import`;'\n",
      "\n",
      "add_indices: '/Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/bin/cypher-shell' -d kg-import -u neo4j -p neo4jdemo -f '/Users/Peter/Library/Application Support/Neo4j Desktop/Application/relate-data/dbmss/dbms-763cbf0d-6660-412a-8042-c55ae40d5290/import/indices.cypher'\n",
      "\n"
     ]
    }
   ],
   "source": [
    "neo4j_bulk_importer.import_from_csv_to_neo4j_desktop(verbose=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c70e2dd2-ad17-4def-bf49-5a42017f0f17",
   "metadata": {},
   "source": [
    "## Connect to the local Neo4j Graph database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "3d5b04d6-faf8-4a57-9f5e-60a0015748f2",
   "metadata": {},
   "outputs": [],
   "source": [
    "database = os.environ.get(\"NEO4J_DATABASE\")\n",
    "username = os.environ.get(\"NEO4J_USERNAME\")\n",
    "password = os.environ.get(\"NEO4J_PASSWORD\")\n",
    "\n",
    "graph = Graph(\"bolt://localhost:7687\", name=database, user=username, password=password)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0fe71ba6-9fe0-4633-8130-4d2fe6c7608e",
   "metadata": {},
   "source": [
    "## Metadata"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2f49361f-e963-45e3-afde-f3f1cb4b8b72",
   "metadata": {},
   "source": [
    "### Node metadata\n",
    "The MetaNodes and MetaRelationships define the structure of the KG and the properties of nodes and relationships. The query below lists the nodes and their properties."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "7f35cc1d-519e-4b63-b3c7-ba4be2138e0f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeName</th>\n",
       "      <th>synonyms</th>\n",
       "      <th>name</th>\n",
       "      <th>location</th>\n",
       "      <th>id</th>\n",
       "      <th>population</th>\n",
       "      <th>firstName</th>\n",
       "      <th>lastName</th>\n",
       "      <th>smoker</th>\n",
       "      <th>sex</th>\n",
       "      <th>age</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>State</td>\n",
       "      <td>Alternate names of state (string[])</td>\n",
       "      <td>Name of state (string)</td>\n",
       "      <td>Latitude and longitude in WGS-84 format (point{crs:WGS-84})</td>\n",
       "      <td>Geonames.org id for location (string)</td>\n",
       "      <td>Population (int)</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>City</td>\n",
       "      <td>Alternate names of city (string[])</td>\n",
       "      <td>Name of city (string)</td>\n",
       "      <td>Latitude and longitude in WGS-84 format (point{crs:WGS-84})</td>\n",
       "      <td>Geonames.org id for location (string)</td>\n",
       "      <td>Population (int)</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Symptom</td>\n",
       "      <td></td>\n",
       "      <td>Name of symptom (string)</td>\n",
       "      <td></td>\n",
       "      <td>Symptom id from Symptom Ontology (string)</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Patient</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td>Unique patient id (string)</td>\n",
       "      <td></td>\n",
       "      <td>First name (string)</td>\n",
       "      <td>Last name (string)</td>\n",
       "      <td>Patient is a smoker (boolean)</td>\n",
       "      <td>Biological sex (string)</td>\n",
       "      <td>Age (int)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Disease</td>\n",
       "      <td></td>\n",
       "      <td>Name of disease from Human Disease Ontology (string)</td>\n",
       "      <td></td>\n",
       "      <td>Disease id from Human Disease Ontology (string)</td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  nodeName                             synonyms  \\\n",
       "0    State  Alternate names of state (string[])   \n",
       "1     City   Alternate names of city (string[])   \n",
       "2  Symptom                                        \n",
       "3  Patient                                        \n",
       "4  Disease                                        \n",
       "\n",
       "                                                   name  \\\n",
       "0                                Name of state (string)   \n",
       "1                                 Name of city (string)   \n",
       "2                              Name of symptom (string)   \n",
       "3                                                         \n",
       "4  Name of disease from Human Disease Ontology (string)   \n",
       "\n",
       "                                                      location  \\\n",
       "0  Latitude and longitude in WGS-84 format (point{crs:WGS-84})   \n",
       "1  Latitude and longitude in WGS-84 format (point{crs:WGS-84})   \n",
       "2                                                                \n",
       "3                                                                \n",
       "4                                                                \n",
       "\n",
       "                                                id        population  \\\n",
       "0            Geonames.org id for location (string)  Population (int)   \n",
       "1            Geonames.org id for location (string)  Population (int)   \n",
       "2        Symptom id from Symptom Ontology (string)                     \n",
       "3                       Unique patient id (string)                     \n",
       "4  Disease id from Human Disease Ontology (string)                     \n",
       "\n",
       "             firstName            lastName                         smoker  \\\n",
       "0                                                                           \n",
       "1                                                                           \n",
       "2                                                                           \n",
       "3  First name (string)  Last name (string)  Patient is a smoker (boolean)   \n",
       "4                                                                           \n",
       "\n",
       "                       sex        age  \n",
       "0                                      \n",
       "1                                      \n",
       "2                                      \n",
       "3  Biological sex (string)  Age (int)  \n",
       "4                                      "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:MetaNode) RETURN n;\n",
    "\"\"\"\n",
    "df = graph.run(query).to_data_frame()\n",
    "metadata = df[\"n\"].tolist()\n",
    "metadata = pd.DataFrame(metadata)\n",
    "metadata.fillna(\"\", inplace=True)\n",
    "metadata"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "13b00ca4-fccf-42a0-b6bc-e96522dc5eca",
   "metadata": {},
   "source": [
    "## Number of Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "47b886e1-8ae7-49e3-8bc7-a24fff9f4833",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total number of nodes: 19\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n) RETURN COUNT(n);\n",
    "\"\"\"\n",
    "print(f\"Total number of nodes: {graph.evaluate(query)}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "95b9d9d7-2c1c-4a85-8e5b-62b9785446d5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Node</th>\n",
       "      <th>Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>MetaNode</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Symptom</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Disease</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Patient</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>City</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>State</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Node  Count\n",
       "0  MetaNode      5\n",
       "1   Symptom      4\n",
       "2   Disease      3\n",
       "3   Patient      3\n",
       "4      City      3\n",
       "5     State      1"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n) RETURN labels(n)[0] AS Node, COUNT(n) AS Count\n",
    "ORDER BY Count DESC\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0be706a2-e004-4b58-bd2a-aa5e5a1f7540",
   "metadata": {},
   "source": [
    "## Number of relationships by relationship type"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "9f2f6c39-a3db-49fc-bf59-80e24928b5cc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Relationship</th>\n",
       "      <th>Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>MetaRelationship</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>PRESENTS</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SHOWS</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>LOCATED_IN</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>DIAGNOSED_WITH</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>LIVES_IN</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Relationship  Count\n",
       "0  MetaRelationship      5\n",
       "1          PRESENTS      4\n",
       "2             SHOWS      4\n",
       "3        LOCATED_IN      3\n",
       "4    DIAGNOSED_WITH      3\n",
       "5          LIVES_IN      3"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH ()-[r]-() RETURN DISTINCT TYPE(r) AS Relationship, COUNT(DISTINCT r) AS Count\n",
    "ORDER BY Count DESC\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
